Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_28 (TimeDis (None, 16, 2, 2, 1280)    2257984   
_________________________________________________________________
dropout_76 (Dropout)         (None, 16, 2, 2, 1280)    0         
_________________________________________________________________
time_distributed_29 (TimeDis (None, 16, 1280)          0         
_________________________________________________________________
bidirectional_13 (Bidirectio (None, 64)                336128    
_________________________________________________________________
dropout_77 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_62 (Dense)             (None, 256)               16640     
_________________________________________________________________
dropout_78 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_63 (Dense)             (None, 128)               32896     
_________________________________________________________________
dropout_79 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_64 (Dense)             (None, 64)                8256      
_________________________________________________________________
dropout_80 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_65 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_81 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_66 (Dense)             (None, 2)                 66        
=================================================================
Total params: 2,654,050
Trainable params: 2,077,602
Non-trainable params: 576,448
_________________________________________________________________


Accuracy Score is :  0.935
Specificity: 0.980
Sensitivity (Recall): 0.891
FPR: 0.020
FNR: 0.109
ROC–AUC: 0.9795979597959796
Cohen’s Kappa: 0.8701039168665068
Matthews Corr Coef: 0.8736436905023661

Classification Report is : 
               precision    recall  f1-score   support

           0       0.90      0.98      0.94        99
           1       0.98      0.89      0.93       101

    accuracy                           0.94       200
   macro avg       0.94      0.94      0.93       200
weighted avg       0.94      0.94      0.93       200
